#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_string.tf-storage-name: Refreshing state... [id=tmccfvikzuankdqxpfg10ko]
random_pet.aks: Refreshing state... [id=aks-beloved-wren]
azurerm_resource_group.rg-aks: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks]
azurerm_resource_group.rg-networking: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking]
azurerm_resource_group.rg-tf-state: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-tf-state]
azurerm_public_ip.vip-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/publicIPAddresses/vip-bastion]
azurerm_network_security_group.nsg-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/networkSecurityGroups/nsg-default]
azurerm_virtual_network.vnet-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default]
azurerm_storage_account.tf-storage: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-tf-state/providers/Microsoft.Storage/storageAccounts/tmccfvikzuankdqxpfg10ko]
azurerm_network_security_group.nsg-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/networkSecurityGroups/nsg-bastion]
azurerm_subnet.subnet-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/DefaultSubnet]
azurerm_subnet.subnet-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/AzureBastionSubnet]
azurerm_subnet.subnet-aks: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/AKSSubnet]
azurerm_kubernetes_cluster.aks-lab: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks/providers/Microsoft.ContainerService/managedClusters/aks-beloved-wren]
azurerm_bastion_host.bastion-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/bastionHosts/bastion-default]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_bastion_host.bastion-default has been deleted
  - resource "azurerm_bastion_host" "bastion-default" {
      - copy_paste_enabled     = true -> null
      - dns_name               = "bst-72300980-86e2-4653-864b-f461e114a47a.bastion.azure.com" -> null
      - file_copy_enabled      = false -> null
      - id                     = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/bastionHosts/bastion-default" -> null
      - ip_connect_enabled     = false -> null
      - location               = "eastus" -> null
      - name                   = "bastion-default" -> null
      - resource_group_name    = "rg-networking" -> null
      - scale_units            = 2 -> null
      - shareable_link_enabled = false -> null
      - sku                    = "Standard" -> null
      - tags                   = {} -> null
      - tunneling_enabled      = false -> null

      - ip_configuration {
          - name                 = "configuration" -> null
          - public_ip_address_id = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/publicIPAddresses/vip-bastion" -> null
          - subnet_id            = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/AzureBastionSubnet" -> null
        }
    }

  # azurerm_kubernetes_cluster.aks-lab has been deleted
  - resource "azurerm_kubernetes_cluster" "aks-lab" {
      - api_server_authorized_ip_ranges     = [] -> null
      - azure_policy_enabled                = false -> null
      - dns_prefix                          = "aks-beloved-wren-k8s" -> null
      - enable_pod_security_policy          = false -> null
      - fqdn                                = "aks-beloved-wren-k8s-601e5634.hcp.eastus.azmk8s.io" -> null
      - http_application_routing_enabled    = false -> null
      - id                                  = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks/providers/Microsoft.ContainerService/managedClusters/aks-beloved-wren" -> null
      - kube_admin_config                   = (sensitive value)
      - kube_config                         = (sensitive value)
      - kube_config_raw                     = (sensitive value)
      - kubernetes_version                  = "1.22.6" -> null
      - local_account_disabled              = false -> null
      - location                            = "eastus" -> null
      - name                                = "aks-beloved-wren" -> null
      - node_resource_group                 = "MC_rg-aks_aks-beloved-wren_eastus" -> null
      - oidc_issuer_enabled                 = false -> null
      - open_service_mesh_enabled           = false -> null
      - portal_fqdn                         = "aks-beloved-wren-k8s-601e5634.portal.hcp.eastus.azmk8s.io" -> null
      - private_cluster_enabled             = false -> null
      - private_cluster_public_fqdn_enabled = false -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "rg-aks" -> null
      - role_based_access_control_enabled   = true -> null
      - run_command_enabled                 = true -> null
      - sku_tier                            = "Free" -> null
      - tags                                = {
          - "deployedBy"  = "terraform"
          - "environment" = "lab"
          - "msftalias"   = "sladeedmonds"
        } -> null

      - default_node_pool {
          - enable_auto_scaling          = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          - kubelet_disk_type            = "OS" -> null
          - max_count                    = 0 -> null
          - max_pods                     = 30 -> null
          - min_count                    = 0 -> null
          - name                         = "pool0" -> null
          - node_count                   = 3 -> null
          - node_labels                  = {} -> null
          - node_taints                  = [] -> null
          - only_critical_addons_enabled = false -> null
          - orchestrator_version         = "1.22.6" -> null
          - os_disk_size_gb              = 30 -> null
          - os_disk_type                 = "Managed" -> null
          - os_sku                       = "Ubuntu" -> null
          - tags                         = {} -> null
          - type                         = "VirtualMachineScaleSets" -> null
          - ultra_ssd_enabled            = false -> null
          - vm_size                      = "Standard_D2_v2" -> null
          - vnet_subnet_id               = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/AKSSubnet" -> null
          - zones                        = [] -> null
        }

      - linux_profile {
          - admin_username = "slade" -> null

          - ssh_key {
              - key_data = <<-EOT
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCpFQ3NdnxEmqEEOQpyJ4oc+3NmH++2sap7itHe0Z05ZPR4jUbgAwFyGM6ujQBYsiTtxnuKYUV+qh2UWm1qlPucC9sNjH/hs56XHFsFl25R+IuHSk0aoz2c7wwaHnS7Ee7uTic0muhnGrjgadalylOQTFIqf++aKo+6DP+/7J/ewDpRGVBmkFZKGN4VUpBq45E9SNkPGn/FEhCTlHK3WZ/3P+k/0kOOKdbnyjIqM44uukMvgLvwBD2LSEopriuNLnYQCxvTnQksCVHksOUYRwvyTEeeqGTdlO+H1cotsPeXTpps6ADShy0mK459Ltp0QlATK7KXHt2Gl9aG37DL2OQk2t3XHWJ8otoc0QRY/D+85vwMN1LKAA88OGUtMT9SIrwT4suV5kEsWAs2HMKBmBYE5LlU+yZZLFPDXdanZs4W2gn9oC03osQeOuPlcBh6YNmxf91AQgsWraMuKamNljtF07/p99lFWdCZS3vt1iTfHHJw8ncbVRTli663OOKS1Ms= slade@LAPTOP-2GJQMV56
                EOT -> null
            }
        }

      - network_profile {
          - dns_service_ip     = "10.0.0.10" -> null
          - docker_bridge_cidr = "172.17.0.1/16" -> null
          - ip_versions        = [
              - "IPv4",
            ] -> null
          - load_balancer_sku  = "standard" -> null
          - network_plugin     = "azure" -> null
          - outbound_type      = "loadBalancer" -> null
          - service_cidr       = "10.0.0.0/16" -> null

          - load_balancer_profile {
              - effective_outbound_ips    = [
                  - "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/MC_rg-aks_aks-beloved-wren_eastus/providers/Microsoft.Network/publicIPAddresses/b572d2e1-7d3f-48fb-962c-ea9f11430eff",
                ] -> null
              - idle_timeout_in_minutes   = 0 -> null
              - managed_outbound_ip_count = 1 -> null
              - outbound_ip_address_ids   = [] -> null
              - outbound_ip_prefix_ids    = [] -> null
              - outbound_ports_allocated  = 0 -> null
            }
        }

      - service_principal {
          - client_id     = "539cf86f-4c4f-4ed2-ae8c-4c590889c4c7" -> null
          - client_secret = (sensitive value)
        }

      - windows_profile {
          - admin_username = "azureuser" -> null
        }
    }

  # azurerm_network_security_group.nsg-bastion has changed
  ~ resource "azurerm_network_security_group" "nsg-bastion" {
        id                  = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/networkSecurityGroups/nsg-bastion"
        name                = "nsg-bastion"
      ~ security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowGatewayManager"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "GatewayManager"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowSladeHomeHttps"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "172.125.57.122"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = null
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowGatewayManager"
              - priority                                   = 110
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "GatewayManager"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = null
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowSladeHomeHttps"
              - priority                                   = 100
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "172.125.57.122"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
            # (1 unchanged element hidden)
        ]
        tags                = {
            "createdBy" = "Terraform"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg-aks has been deleted
  - resource "azurerm_resource_group" "rg-aks" {
      - id       = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks" -> null
      - location = "eastus" -> null
      - name     = "rg-aks" -> null
      - tags     = {} -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_bastion_host.bastion-default will be created
  + resource "azurerm_bastion_host" "bastion-default" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "bastion-default"
      + resource_group_name    = "rg-networking"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Standard"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/publicIPAddresses/vip-bastion"
          + subnet_id            = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/AzureBastionSubnet"
        }
    }

  # azurerm_kubernetes_cluster.aks-lab will be created
  + resource "azurerm_kubernetes_cluster" "aks-lab" {
      + dns_prefix                          = "aks-beloved-wren-k8s"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus"
      + name                                = "aks-beloved-wren"
      + node_resource_group                 = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-aks"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "deployedBy"  = "terraform"
          + "environment" = "lab"
          + "msftalias"   = "sladeedmonds"
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "pool0"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
          + vnet_subnet_id       = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/AKSSubnet"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + linux_profile {
          + admin_username = "slade"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCpFQ3NdnxEmqEEOQpyJ4oc+3NmH++2sap7itHe0Z05ZPR4jUbgAwFyGM6ujQBYsiTtxnuKYUV+qh2UWm1qlPucC9sNjH/hs56XHFsFl25R+IuHSk0aoz2c7wwaHnS7Ee7uTic0muhnGrjgadalylOQTFIqf++aKo+6DP+/7J/ewDpRGVBmkFZKGN4VUpBq45E9SNkPGn/FEhCTlHK3WZ/3P+k/0kOOKdbnyjIqM44uukMvgLvwBD2LSEopriuNLnYQCxvTnQksCVHksOUYRwvyTEeeqGTdlO+H1cotsPeXTpps6ADShy0mK459Ltp0QlATK7KXHt2Gl9aG37DL2OQk2t3XHWJ8otoc0QRY/D+85vwMN1LKAA88OGUtMT9SIrwT4suV5kEsWAs2HMKBmBYE5LlU+yZZLFPDXdanZs4W2gn9oC03osQeOuPlcBh6YNmxf91AQgsWraMuKamNljtF07/p99lFWdCZS3vt1iTfHHJw8ncbVRTli663OOKS1Ms= slade@LAPTOP-2GJQMV56"
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + service_principal {
          + client_id     = "539cf86f-4c4f-4ed2-ae8c-4c590889c4c7"
          + client_secret = (sensitive value)
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # azurerm_resource_group.rg-aks will be created
  + resource "azurerm_resource_group" "rg-aks" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-aks"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @sladeedmonds, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*